# lst = [12, 4, 5, 32, 45, 6]


# написать цикл, который счетает сумму всех чисел
# которые меньше 20
# в конце вывести результат

# sum_ = 0

# for elem in lst:
# 	if elem % 2 == 0:
# 		sum_ += elem

# print(sum_)

# заменить в списке все нечетные значения на -1

# for i in range(len(lst)):
# 	if lst[i] % 2 == 1:
# 		lst[i] = -1

# print(lst)


# написать цикл, который счетает сумму всех чисел
# которые меньше 20
# в конце вывести результат


lst = [12, 4, 5, 32, 45, 6]

# sum_ = 0

# for elem in lst:
# 	if elem < 20:
# 		sum_ += elem

# print(sum_)

# написать цикл, который выводит все числа, 
# кратные 5


# for elem in lst:
# 	if elem % 5 == 0:
# 		print(elem)


# написать цикл, который выводит числа от 0 до 20

# print(range(12)) # 0, 1, 2, 3 .. , 10, 11

# вывести числа, кратные трем от 0 до 20

# sum_ = 0

# for i in range(31):
# 	if i % 2 == 0:
# 		sum_ += i

# print(sum_)


lst = [12, 4, 32, 5, 3, 21]

# написать цикл, который находит сумму чисел
# которые кратны 4

sum_ = 0

for elem in lst:
	if elem % 4 == 0:
		sum_ += elem

print(sum_)


